app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 AND "addresses"."id" = $2 LIMIT $3  [["user_id", 19], ["id", 2], ["LIMIT", 1]]
---
    def show
        @address = @current_user.addresses.find_by(id: params[:id])

INSERT INTO "addresses" ("street_address", "city", "state", "zip_code", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @address = Address.create(address_params.merge(user_id: @current_user.id))

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def update
        @address = Address.find_by(id: params[:id], user_id: @current_user.id)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 9]]
---
    def destroy
        @address = Address.find_by(id: params[:id])
        if @address&.destroy