app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 14], ["LIMIT", 1]]
SELECT 1 AS one FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 14], ["id", 4], ["LIMIT", 1]]
---
	def add_product
		cart = @current_user.cart.products
		select_product = Product.find(params[:id])

		if cart.include?(select_product)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 16], ["LIMIT", 1]]
SELECT 1 AS one FROM "products" INNER JOIN "carts_products" ON "products"."id" = "carts_products"."product_id" WHERE "carts_products"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 18], ["id", 6], ["LIMIT", 1]]
---
	def remove_product
	    unless @current_user
	 	 render json: {error: "User not authenticated"}, status: :unauthorized
	 	 return
	    end

	    unless @current_user.cart
	 	 render json: {error: "user doest not have a cart"}, status: :unprocessable_entity
	 	 return
	    end

        product = Product.find_by(id: params[:id])

        if product
      	    cart = @current_user.cart
      	    if cart.products.include?(product)