app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone", "password_digest", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at", "reset_password_used", "stripe_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

	def destroy
		@current_user == @user
		if @current_user.present?
			@current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]